In [1]:
import sqlite3
import matplotlib.pyplot as plot
import pandas as pd
import numpy as np
cnx = sqlite3.connect("database/jstor-authority.db")
cursor = cnx.cursor()

In [6]:
query = "select * from articles limit 1"

In [7]:
pd.read_sql_query(query,cnx)

,id,position,last_name,first_initial,middle_initial,suffix,title,journal_name,fullname,first_name,middle_name,language,authors,mesh_terms,affiliation,title_full,year
0,10.2307/4072856,1,Stone,W,,,glaucous gull larus hyperboreus philadelphia,The Auk,Witmer Stone,Witmer,,eng,Witmer Stone,Glaucous Gull (Larus hyperboreus) at Philadelphia,1918,,0

In [20]:
query = "select count(*) as c, full_name from google_scholar_no_dups group by full_name order by c desc"
print(pd.read_sql_query(query, cnx))
query = "select * from google_scholar_no_dups where full_name like 'Anders Nielsen'"
print(pd.read_sql_query(query, cnx))

       c          full_name
0      4           Wei Wang
1      3     Anders Nielsen
2      3      Isabel Castro
3      3     Muhammad Aslam
4      2         Adam Davis
...   ..                ...
22916  1      Ülo Niinemets
22917  1           Ülo Väli
22918  1     Şerban Procheş
22919  1     Željko Cvetnić
22920  1  Željko Grabarević

[22921 rows x 2 columns]
   ids_len                ids       full_name       name_id
0       15    4122785,4496065  Anders Nielsen  4bg2BdYAAAAJ
1       17  24874345,24872830  Anders Nielsen  GrOIVw8AAAAJ
2       17  23213953,24432285  Anders Nielsen  k_9RuXkAAAAJ

In [11]:
query = "select * from articles_2_ab where id = '24039796' and position = 1"
print(pd.read_sql_query(query,cnx))

         id  position last_name first_initial middle_initial suffix  \
0  24039796         1      Lang             M

                                               title  \
0  functional characterization bjcet3 bjcet4 two ...

                     journal_name       fullname first_name middle_name  \
0  Journal of Experimental Botany  Minglin  Lang    Minglin

  language                                            authors  \
0      eng  Minglin  Lang,Mengyu  Hao,Qiangwang  Fan,Wei  ...

                                          mesh_terms affiliation  \
0  Humans,*Saccharomyces cerevisiae,*Tobacco,*See...

                                          full_title
0  Functional characterization of BjCET3 and BjCE...

In [23]:
query = "select count(distinct id) from articles"
pd.read_sql_query(query,cnx)

DatabaseError: Execution failed on sql 'select count(distinct id) from articles_2_ab': no such table: articles_2_ab